Problem 1: Replace and Modify Data
Replace all students in "New York" with Marks below 80 by increasing their Marks by 10%.
Change the Age of any student named "Alice" to the maximum Age in the DataFrame.
Replace all Cities in which Marks > 90 with "Top Scorer City".

Problem 2: Advanced Filtering and Sorting
Create a new DataFrame with students whose Age is below 20 and Marks are greater than 70.
Sort the new DataFrame by both City (ascending) and Marks (descending).

Problem 3: Grouping with Multi-Level Aggregations
Calculate both:
The average Age for each combination of Gender and City.
The total Marks for each City.
Determine the number of students for each combination of City and Grade ("A", "B", "C") based on Marks thresholds you choose.

Problem 4: Custom Column Creation
Create a column "Performance" based on Age:

"Young Achiever" for students with Age < 20 and Marks > 85.
"Promising" for Marks between 70 and 85.
"Needs Improvement" for others.
Add a column "YearsSinceJoined" by subtracting the year in the "JoinDate" column from the current year (2025).

In [4]:
import pandas as pd

In [23]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[14,17,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [24]:
def s(row):
    if row["City"]=="New York" and row["Marks"]<80:
        return row["Marks"]*1.10
    else:
        return row["Marks"]
vr["Marks"]=vr.apply(s,axis=1)

In [25]:
vr.loc[vr["Name"]=="Alice","Age"]=vr["Age"].max()
vr

    Name  Age  Gender  Marks          City
0   John   14    Male     88      New York
1  Alice   21  Female     92   Los Angeles
2    Bob   12    Male     75       Chicago
3   Emma   21  Female     89  San Fransico

In [26]:
def f(row):
    if row["Marks"]>90:
        return "Top Scorer City"
    else:
        return row["City"]
vr["City"]=vr.apply(f,axis=1)

In [27]:
df=vr.loc[(vr["Age"]<20)&(vr["Marks"]>70)]
d=pd.DataFrame(df)
d

   Name  Age Gender  Marks      City
0  John   14   Male     88  New York
2   Bob   12   Male     75   Chicago

In [32]:
d.sort_values(by=["City","Marks"],ascending=[True,False])

   Name  Age Gender  Marks      City
2   Bob   12   Male     75   Chicago
0  John   14   Male     88  New York

In [54]:
vr.groupby(['Gender','City'])['Age'].mean()

Gender  City
Female  San Fransico       21.0
        Top Scorer City    21.0
Male    Chicago            12.0
        New York           14.0
Name: Age, dtype: float64

In [55]:
vr.groupby('City')['Marks'].sum()

City
Chicago            75
New York           88
San Fransico       89
Top Scorer City    92
Name: Marks, dtype: int64

In [56]:
def per(Marks):
    if Marks>90:
        return "A"
    elif Marks>80:
        return "B"
    else:
        return "C"
vr["Grade"]=vr["Marks"].apply(per)
vr.groupby(['City','Grade']).size()

City             Grade
Chicago          C        1
New York         B        1
San Fransico     B        1
Top Scorer City  A        1
dtype: int64

In [40]:
def d(row):
    if row["Age"]<20 and row["Marks"]>85:
        return "Young Achiever"
    elif row["Marks"]<85 and  row["Marks"]>70:
        return "Promising"
    else:
        return "Needs Improvement"
vr["Performance"]=vr.apply(d,axis=1)
vr

    Name  Age  Gender  Marks             City        Performance
0   John   14    Male     88         New York     Young Achiever
1  Alice   21  Female     92  Top Scorer City  Needs Improvement
2    Bob   12    Male     75          Chicago          Promising
3   Emma   21  Female     89     San Fransico  Needs Improvement

In [62]:
import numpy as np
np.random.seed(42)
vr["Joindate"]=pd.to_datetime(np.random.choice(pd.date_range("2023-1-1","2023-12-31")))
vr["Month"]=vr["Joindate"].dt.month
vr["Year"]=pd.DatetimeIndex(vr["Joindate"]).year
vr["YearSinceJoined"]=abs(vr["Year"]-2025)
vr

,Name,Age,Gender,Marks,City,Performance,Joindate,Month,Year,YearSinceJoined,Grade,Day
0,John,14,Male,88,New York,Young Achiever,2023-04-13,4,2023,2,B,2023-04-13
1,Alice,21,Female,92,Top Scorer City,Needs Improvement,2023-04-13,4,2023,2,A,2023-04-13
2,Bob,12,Male,75,Chicago,Promising,2023-04-13,4,2023,2,C,2023-04-13
3,Emma,21,Female,89,San Fransico,Needs Improvement,2023-04-13,4,2023,2,B,2023-04-13